//Напишите программу, которая на вход принимает число и выводит его квадрат(число умноженное на само себя).

Console.Write("Введите число: ");

int  a = int.Parse(Console.ReadLine());
int b = a * a;

Console.Write("Ответ: ");
Console.Write(a * a);